"""
Необходимо реализовать алгоритм с применением принципов ООП.
При запуске алгоритм генерирует ‘гараж’, в котором находятся
транспортные средства следующих типов: самокат, велосипед,
электросамокат, мотоцикл, автомобиль (от 0 до 2 единиц каждого из типов).
У каждого из транспортных средств есть набор свойств, который
генерируется при создании. Затем алгоритм выводит общее количество транспортных
средств в гараже и количество автомобилей, а также подробное описание каждого
из транспортных средств (Например ‘Самокат: вес - 12.4 кг, цвет – красный’).

Свойства транспортных средств:
Самокат – вес, цвет.
Велосипед – вес, цвет, количество передач.
Электросамокат - вес, цвет, мощность электромотора.
Мотоцикл – вес, цвет, мощность мотора, время разгона до 100 км/ч.
Автомобиль – вес, цвет, мощность мотора, время разгона до 100 км/ч,
                                    расположение руля(правое/левое).
"""